---
type: IRebarUpdateServer
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 5
tags: [revit-api, class]
---

# IRebarUpdateServer

`Autodesk.Revit.DB.Structure.IRebarUpdateServer` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GenerateCurves | 2018 | `bool GenerateCurves ( RebarCurvesData curvesData )` |
| Method | GetCustomHandleName | 2018 | `bool GetCustomHandleName ( RebarHandleNameData handleNameData )` |
| Method | GetCustomHandles | 2018 | `bool GetCustomHandles ( RebarHandlesData handlesInfoData )` |
| Method | GetHandlesPosition | 2018 | `bool GetHandlesPosition ( RebarHandlePositionData handlePositionData )` |
| Method | TrimExtendCurves | 2018 | `bool TrimExtendCurves ( RebarTrimExtendData trimExtendData )` |